/* Alert */
"alert.ok" = "知道了";

/* Error: stitch failed */
"error.stitch_failed.title" = "拼接失败";

/* Error: import to Photos failed */
"error.import_failed.title" = "导入到 Photos 失败";

/* Error: save failed */
"error.save_failed.title" = "保存失败";
"error.save_failed.message" = "无法写入目录 %@，可能是只读卷或权限不足。";
"error.save_failed.fallback_hint" = "\n\n已保存到备用位置：%@";

/* Error: insufficient input */
"error.insufficient.title" = "收到的图片不够";
"error.insufficient.open_files" = "当前入口只传进来不到 2 张图。请在 Finder 里多选后用\u201c打开方式 \u2192 拼成长图\u201d再试一次。";
"error.insufficient.command_line" = "命令行模式至少要传 2 个图片路径。";

/* Error: no valid images */
"error.no_images.title" = "没有可拼接的图片";
"error.no_images.message" = "这次没有收到任何有效的图片文件。";

/* Error: canvas */
"error.canvas_failed.title" = "创建画布失败";
"error.canvas_failed.message" = "系统没能创建用于拼接的位图上下文。";

/* Error: composite */
"error.composite_failed.title" = "生成长图失败";
"error.composite_failed.message" = "系统没能从画布里导出最终图像。";

/* Error: load image */
"error.load_failed.title" = "读取图片失败";
"error.load_failed.not_image" = "文件\u201c%@\u201d不是系统能正常读取的图片。";
"error.load_failed.decode" = "文件\u201c%@\u201d解码失败。";

/* Error: unsupported format */
"error.unsupported_format.title" = "当前系统不支持输出格式";
"error.unsupported_format.message" = "系统不支持导出为 %@。";

/* Error: write image */
"error.write_failed.title" = "写入图片失败";
"error.write_failed.destination" = "系统没能创建 %@ 输出目标。";
"error.write_failed.finalize" = "系统没能写出最终图片文件。";

/* Error: import rewritten */
"error.import_rewritten.message" = "%@\n\n我已经把生成好的 %@ 文件保留下来了：\n%@";

/* Error: pasteboard */
"error.pasteboard_empty" = "没有从粘贴板里读到图片文件。";

/* Error: Photos permission */
"error.photos_denied.title" = "没有照片权限";
"error.photos_denied.message" = "请在\u201c系统设置 -> 隐私与安全性 -> 照片\u201d里允许\u201c拼成长图\u201d添加照片，然后再试一次。";
"error.photos_undetermined.title" = "照片权限未确定";
"error.photos_undetermined.message" = "系统没有完成照片权限授权，请重新执行一次。";
"error.photos_unknown.title" = "照片权限异常";
"error.photos_unknown.message" = "系统返回了未知的照片权限状态。";

/* File naming */
"file.stitch_prefix" = "拼接";
"file.fallback_directory" = "拼成长图";
